app/controllers/logs_controller.rb

  def index
    @logs = Log.all
---
SELECT "logs".* FROM "logs"

  def create
    @log = Log.new(log_params)

    respond_to do |format|
      if @log.save
---
INSERT INTO "logs" ("subject_id", "button_name", "position_x", "position_y", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["subject_id", "5"], ["button_name", "but2"], ["position_x", "15"], ["position_y", "234.8000030517578"], ["created_at", "2020-03-02 21:08:56.934076"], ["updated_at", "2020-03-02 21:08:56.934076"]]

    def set_log
      @log = Log.find(params[:id])
---
SELECT  "logs".* FROM "logs" WHERE "logs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]