app/controllers/subjects_controller.rb

  def create
    @subject = Subject.new(subject_params)

    respond_to do |format|
      if @subject.save
---
INSERT INTO "subjects" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2020-02-19 16:46:21.286498"], ["updated_at", "2020-02-19 16:46:21.286498"]]